-- Создание таблицы
CREATE TABLE Books (
    ID INT PRIMARY KEY,
    Title VARCHAR(50),
    Author VARCHAR(50),
    Genre VARCHAR(50),
    Year INT,
    ISBN VARCHAR(50)
);

-- Вставка данных
INSERT INTO Books (ID, Title, Author, Genre, Year, ISBN) VALUES
(1, 'Война и мир', 'Лев Толстой', 'Роман', 1869, '123-456-789-X'),
(2, '1984', 'Джордж Оруэлл', 'Дистопия', 1949, '234-567-890-X'),
(3, 'Улисс', 'Джеймс Джойс', 'Модернизм', 1922, '345-678-901-X'),
(4, 'Великий Гэтсби', 'Фрэнсис Скотт Фицджеральд', 'Роман', 1925, '456-789-012-X'),
(5, 'Моби Дик', 'Герман Мелвилл', 'Приключения', 1851, '567-890-123-X');
