-- Создание таблицы
CREATE TABLE Books (
    ID SERIAL PRIMARY KEY,
    Title VARCHAR(50),
    Author VARCHAR(50),
    Genre VARCHAR(50),
    Year INT,
    ISBN VARCHAR(50)
);

-- Вставка данных
INSERT INTO Books (Title, Author, Genre, Year, ISBN) VALUES
('Война и мир', 'Лев Толстой', 'Роман', 1869, '123-456-789-X'),
('1984', 'Джордж Оруэлл', 'Дистопия', 1949, '234-567-890-X'),
('Улисс', 'Джеймс Джойс', 'Модернизм', 1922, '345-678-901-X'),
('Великий Гэтсби', 'Фрэнсис Скотт Фицджеральд', 'Роман', 1925, '456-789-012-X'),
('Моби Дик', 'Герман Мелвилл', 'Приключения', 1851, '567-890-123-X'),
('Преступление и наказание', 'Фёдор Достоевский', 'Роман', 1866, '678-901-234-X'),
('Гордость и предубеждение', 'Джейн Остен', 'Роман', 1813, '789-012-345-X'),
('В поисках утраченного времени', 'Марсель Пруст', 'Модернизм', 1913, '890-123-456-X'),
('Гамлет', 'Уильям Шекспир', 'Трагедия', 1603, '901-234-567-X'),
('Божественная комедия', 'Данте Алигьери', 'Эпическая поэма', 1320, '012-345-678-X'),
('Тошнота', 'Жан-Поль Сартр', 'Экзистенциализм', 1938, '123-456-789-Y'),
('Собака Баскервилей', 'Артур Конан Дойл', 'Детектив', 1902, '234-567-890-Y'),
('Фауст', 'Иоганн Вольфганг фон Гёте', 'Трагедия', 1808, '345-678-901-Y'),
('Идиот', 'Фёдор Достоевский', 'Роман', 1869, '456-789-012-Y'),
('Маугли', 'Редьярд Киплинг', 'Рассказ', 1894, '789-012-345-Y'),
('Анна Каренина', 'Лев Толстой', 'Роман', 1877, '890-123-456-Y'),
('Повелитель мух', 'Уильям Голдинг', 'Роман', 1954, '901-234-567-Y'),
('Робинзон Крузо', 'Даниэль Дефо', 'Приключения', 1719, '012-345-678-Y');
